# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

numbers = [6, -4, 3, 8, 2, 0, 7]
<<<<<<< HEAD
#i = 0
#count = 0
#while i < len(numbers):
#    count = count + numbers[i]
#    print(count)
#    i += 1

# Вариант-1
#count = 0
#for number in numbers:
#    count += number
#    print(count)

# Вариант-2
print(sum(numbers))
=======
# Вариант-1
total = 0
for number in numbers:
    total += number

# Вариант-2
total = sum(numbers)

print(total)
>>>>>>> b7debe27b796680c692f73ea48b5dee08bade5d0
