# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

numbers = [6, -4, 3, 8, 2, 0, 7]
#i = 0
#count = 0
#while i < len(numbers):
#    count = count + numbers[i]
#    print(count)
#    i += 1

# Вариант-1
#count = 0
#for number in numbers:
#    count += number
#    print(count)

# Вариант-2
print(sum(numbers))