# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["банан", "яблоко", "киви", "арбуз"]
max_lenght = max(len(fruits) for fruit in fruits)
for i, fruit in enumerate(fruits, 1):
    spaces = max_lenght - len(fruit)
    print(i, " " * spaces, fruit)

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
