# Даны два целых числа.
# Вывести список всех чисел кратных трем в диапазоне между заданными числами.

first_number = int(input("Введите первое число диапазона: "))     # Первое число
second_number = int(input("Введите второе число диапазона: "))    # Второе число
number = first_number
list = ?
while number <= second_number:
    if number % 3 == 0:
        list .......

    number += 1
print(list, end= ",")