text = "Lorem ipsum dolor sit amet consectetur adipiscing elit Integer porttitor bibendum nisi ut convallis ante"
### Задание
# Определить в предоставленном сообщении количество слов длиной больше, чем 5.
### Формат входных данных
# Дана строка текста, слова разделены пробелами, знаки препинания отсутствуют.
### Формат выходных данных
# Вывести количество найденных слов.
worlds = text.find(sub[4:]).count()
print(worlds)