# Дан код задачи "Длины слов":
words = ["hello", "world", "python"]
#lengths = []
#for word in words:
#    lengths.append(len(word))
#print(lengths)

# Перепишите его, используя list comprehensions:

...
lengths = [len(word) for word in words]
print(lengths)

...