# Напишите функцию для расчета площади прямоугольника.
#
# Входные данные:
#   w: ширина прямоугольника.
#   h: высота прямоугольника.
# Результат:
#   площадь прямоугольника.

<<<<<<< HEAD
def calculate_rectangle_area(width: int|float, height: int|float):
=======
def calculate_rectangle_area(width: int|float, height: int|float) -> int|float:
>>>>>>> ebdecbfce68d73ae8292aa219db282690adf0139
    return width * height
<<<<<<< HEAD
=======


<<<<<<< HEAD
>>>>>>> 8136760f2e4c90398bfaa30199e9553bc21e1405
width = int(input("width = "))
height = int(input("height = "))

area = calculate_rectangle_area(width, height)
print(f"Площадь прямоугольника = {area}")
=======
result = calculate_rectangle_area(10, 20)
print(result)
>>>>>>> ebdecbfce68d73ae8292aa219db282690adf0139
