# Рекламная акция
# В сети магазинов "Н-Аудио" проводится рекламная акция. Каждый второй товар – бесплатно.
# Естественно, кассирам дано указание пробивать товары в таком порядке, чтобы магазин потерял как можно меньше денег.
# По списку товаров определите максимальную сумму в чеке.
#
# Вход:дано N натуральных чисел – цены товаров.
# Выход: одно число – максимальная сумма чека.

# Пример
# Вход:
# 2 1 10 50 10
# Выход:
# 70
# Пояснение:
# Возможен такой порядок: 10 2 50 1 10

numbers = [2, 50, 1, 42, 2, 50, 11, 25, 4, 14, 5]
sorted_numbers = sorted(numbers)
print(sorted_numbers)
print(sum(sorted_numbers[i] for i in range(0, len(sorted_numbers), 2)))
