## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

```python
n = int(input("Введите количество карточек: "))
sum_remain = 0
i = 0
# Цикл, который выполнится n-1 раз
while i < n - 1:
    card_number = int(input("Введите номер одной из оставшихся карточек: "))
    if 0 < card_number < n:
        sum_remain += card_number
    i += 1
card_lost = ?
print("Номер потерянной карточки", card_lost)
```
