# Напишите функцию, которая принимает список чисел и возвращает сумму квадратов этих чисел.
<<<<<<< HEAD

=======
>>>>>>> ebdecbfce68d73ae8292aa219db282690adf0139
def square(number):
    return number ** 2

def sum_of_squares(numbers):
    return sum(map(square, numbers))

<<<<<<< HEAD

print(sum_of_squares(2, 4, 5))
=======
print(sum_of_squares([2, -4, 5]))
>>>>>>> ebdecbfce68d73ae8292aa219db282690adf0139
