## "Вывод в файл: Пирамида"

### Задание

Выведите в файл **pyramid.txt** пирамиду из n строк.

Пример:
```
n = 5
    *
   ***
  *****
 *******
*********
```
```
n = 6
     *
    ***
   *****
  *******
 *********
***********
```
**Пояснение**: в каждой строке символов на два больше, чем в предыдущей, символы выровнены по центру по длине самой нижней строки.
### Формат входных данных

Дано целое положительное число, высота(количество строк) пирамиды.

### Формат выходных данных

Программа ничего не выводит в терминал, все символы для отображения пирамиды выводим в файл.

### Решение задачи

n = int(input("Введите количество строк пирамиды, n: "))
path_out = "data/pyramid.txt"

with open(path_out, "w") as file:
    length = 2 * n - 1
    for i in range(n):
        str_of_stars = '*' * (2 * i + 1)
        centered_str = str_of_stars.center(length)
        file.write(centered_str + '\n')


---
<details>
<summary>Подсказка-1</summary>
Вспомните про форматирование строк

```python
line = "**"
print(f"{line:^8}")
```
</details>
