# Дан список имен.
# Найдите самое длинное имя, если таких имен несколько - выведи любое их них

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
longest_name = ""

<<<<<<< HEAD
longest_name = ""
=======
>>>>>>> 91c6c03517893abab01a3c834a1a0cd1c826d49d
for name in names:
    if len(name) > len(longest_name):
        longest_name = name

print(longest_name)
<<<<<<< HEAD


=======
>>>>>>> 91c6c03517893abab01a3c834a1a0cd1c826d49d
