# Напишите программу, выводящую строку "Hello world" n раз.
string = "Hello world"
text = string\n * n
n = int(input("Сколько раз нужно повторить вывод данной строки: "))
i = 0
# Вариант-1
while i <= n:
    print(string)
    i += 1

# Вариант-2
text = string.split()
for string in text:
#print(lengths)



...