# Задача "Моделирование броска костей"
# Используйте функцию random.randint() для имитации броска двух игральных костей (числа от 1 до 6).
# Выведите на экран результат броска каждой кости и их сумму.
import random

<<<<<<< HEAD
import random
throw_of_dice_1 = random.randint(1, 6)
throw_of_dice_2 = random.randint(1, 6)
print(throw_of_dice_1)
print(throw_of_dice_2)
print(throw_of_dice_1 + throw_of_dice_2)

def drop_dice()
    return random.randonit(1, 6)

result = drop_dice()
print(result)
=======
def drop_dice():
    return random.randint(1, 6)

print(drop_dice())
print(drop_dice())
>>>>>>> 040a54448726c63696683ea0a75a24518807d195
