 # Задача "Генерация случайного числа с плавающей точкой в заданном диапазоне"
# Задайте диапазон (например, от -10 до 10).
# Используйте функцию random.uniform() для генерации случайного числа с плавающей точкой в этом диапазоне.
# Выведите на экран сгенерированное число.
<<<<<<< HEAD

=======
>>>>>>> 040a54448726c63696683ea0a75a24518807d195
import random

def generate_number(at: int = -10, to: int = 10) -> float:
    return random.uniform(at, to)

print(generate_number())
print(generate_number())
print(generate_number())
print(generate_number())
<<<<<<< HEAD

=======
>>>>>>> 040a54448726c63696683ea0a75a24518807d195
