# Задача "Моделирование случайного выбора из списка"
# Создайте список элементов (например, список названий городов).
# Выберите случайный элемента из списка.
# Выведите на экран выбранный элемент.

def choice_from_list():
    random.choise = ""
    for i in range(password_length):
        password += random.choice(
            [chr(i) for i in range(ord('a'), ord('z'))] +
            << << << < HEAD
            [chr(i) for i in range(ord('A'), ord('Z'))] +
                                                        [chr(i) for i in range(ord('0'), ord('9'))] + ['@', '!', '%',
                                                                                                       '_', '*']
        )

        return random.choise

    print(choice_from_list(['Волгоград', 'Самара', 'Санкт-Петербург', 'Воронеж']))
